In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("zoo.csv")

In [3]:
# Count number of animals or rows in zoo

In [4]:
df.count()

animal        22
uniq_id       22
water_need    22
dtype: int64

In [5]:
df[['animal']].count()

animal    22
dtype: int64

In [6]:
df['animal'].count()

22

In [7]:
# water needed by all animals

In [8]:
df.water_need.sum()

7650

In [9]:
df.sum()

animal        elephantelephantelephanttigertigertigertigerti...
uniq_id                                                   22253
water_need                                                 7650
dtype: object

In [10]:
df.animal.sum()

'elephantelephantelephanttigertigertigertigertigerzebrazebrazebrazebrazebrazebrazebralionlionlionlionkangarookangarookangaroo'

In [11]:
# smallest/largest value in water neede

In [12]:
df.water_need.max()

600

In [13]:
df.water_need.min()

80

In [14]:
df.water_need.mean()

347.72727272727275

In [15]:
df.water_need.median()

325.0

In [16]:
# Group by

In [17]:
df.groupby('animal').mean()

          uniq_id  water_need
animal
elephant   1002.0  550.000000
kangaroo   1021.0  416.666667
lion       1017.5  477.500000
tiger      1006.0  310.000000
zebra      1012.0  184.285714

In [19]:
df.groupby('animal').sum()

          uniq_id  water_need
animal
elephant     3006        1650
kangaroo     3063        1250
lion         4070        1910
tiger        5030        1550
zebra        7084        1290